window.AREA_MAP = {
    "北海道道北": ["稚内市", "士別市", "名寄市", "留萌市", "枝幸町", "浜頓別町", "中頓別町", "礼文町", "利尻町", "利尻富士町"],
    "北海道道央": ["札幌市", "小樽市", "江別市", "千歳市", "恵庭市", "北広島市", "石狩市", "岩見沢市", "夕張市", "苫小牧市"],
    "北海道道東": ["釧路市", "帯広市", "北見市", "網走市", "根室市", "紋別市", "中標津町", "標津町", "別海町"],
    "北海道道南": ["函館市", "北斗市", "七飯町", "森町", "松前町", "八雲町"],

    "青森県津軽": ["青森市", "弘前市", "黒石市", "五所川原市", "つがる市", "平川市"],
    "青森県三八上北": ["八戸市", "十和田市", "三沢市", "おいらせ町", "六戸町", "東北町"],
    "青森県下北": ["むつ市", "大間町", "東通村", "風間浦村", "佐井村"],

    "岩手県内陸北部": ["盛岡市", "八幡平市", "二戸市", "葛巻町", "岩手町"],
    "岩手県内陸南部": ["花巻市", "北上市", "奥州市", "一関市", "遠野市"],
    "岩手県沿岸北部": ["宮古市", "久慈市", "普代村", "野田村"],
    "岩手県沿岸南部": ["釜石市", "大船渡市", "陸前高田市", "大槌町"],

    "宮城県北部": ["気仙沼市", "登米市", "栗原市", "大崎市", "加美町", "涌谷町", "美里町", "南三陸町"],
    "宮城県中部": ["仙台市", "石巻市", "塩竈市", "多賀城市", "東松島市", "松島町", "利府町"],
    "宮城県南部": ["白石市", "名取市", "角田市", "岩沼市", "蔵王町", "柴田町", "亘理町"],

    "秋田県北部": ["大館市", "北秋田市", "能代市", "鹿角市"],
    "秋田県南部": ["秋田市", "横手市", "大仙市", "湯沢市", "由利本荘市"],

    "山形県北部": ["新庄市", "尾花沢市", "村山市"],
    "山形県中部": ["山形市", "天童市", "寒河江市"],
    "山形県南部": ["米沢市", "南陽市", "長井市"],
    "山形県庄内": ["鶴岡市", "酒田市"],

    "福島県中通り": ["福島市", "郡山市", "白河市", "須賀川市"],
    "福島県浜通り": ["いわき市", "相馬市", "南相馬市"],
    "福島県会津": ["会津若松市", "喜多方市"],

    "熊本県阿蘇": ["阿蘇市", "南阿蘇村", "高森町", "西原村"],
    "長野県中部": ["松本市", "塩尻市", "安曇野市", "大町市", "小川村"],

    "東京都23区": ["千代田区", "中央区", "港区", "新宿区", "渋谷区", "足立区", "練馬区"],
    "東京都多摩東部": ["立川市", "武蔵野市", "調布市"],
    "東京都多摩西部": ["青梅市", "八王子市", "町田市"],

    "大阪府北部": ["大阪市", "吹田市", "豊中市", "高槻市"],
    "大阪府南部": ["堺市", "岸和田市", "泉佐野市"],

    "福岡県北西部": ["福岡市", "糸島市", "宗像市"],
    "福岡県北九州": ["北九州市", "行橋市", "豊前市"],
    "福岡県南部": ["久留米市", "大牟田市", "柳川市"],

    "沖縄県本島地方": ["那覇市", "沖縄市", "名護市", "宜野湾市"],
    "沖縄県宮古島地方": ["宮古島市"],
    "沖縄県八重山地方": ["石垣市", "竹富町", "与那国町"]
};
